on_hacking.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Hacking: examples of seeing through and unseeing in my life</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="simple.css" />
</head>
<body>
<div id="preamble" class="status">
<div style="position: fixed; top: 10px; right: 10px;">
         <button class="toggle-theme-btn" onclick="toggleDarkMode()">Light/Dark</button>
       </div>
</div>
<div id="content" class="content">
<h1 class="title">Hacking: examples of seeing through and unseeing in my life</h1>
<p>
<a href="./index.html">Home</a>
</p>

<hr />
<p>
<i>“Don’t mistake my generosity for generosity.”</i><br />
White Rose, from <i><a href="https://en.wikipedia.org/wiki/Mr._Robot">Mr. Robot</a></i>
</p>
<hr />

<div id="outline-container-org6178433" class="outline-2">
<h2 id="org6178433">Introduction: Royce Gracie and the hacker framework</h2>
<div class="outline-text-2" id="text-org6178433">
<p>
The Gracie family saw through combat sports. In the 90s, as a kid, we all wanted to know who would win: a karate or a kung-fu fighter? Either of those or a boxer? Or a wrestler? Our dreams came true at the advent of the Ultimate Fighting Championship (UFC). At the time, we called it bloodsport. It was banned in most states. <a href="https://en.wikipedia.org/wiki/UFC_1">UFC1</a> was a tournament of all kinds of fighters from different domains, from karate to sumo. There were few rules. The goal was either a knockout, submission, or one corner throwing in the towel.
</p>

<p>
I watched so many ninja movies as a kid that I was sure that the karate or kung-fu fighters would destroy the competition. That wasn't the case at all. The winner was <a href="https://en.wikipedia.org/wiki/Royce_Gracie">Royce Gracie</a>, a practitioner of a little-known (at the time) martial art called <a href="https://en.wikipedia.org/wiki/Brazilian_jiu-jitsu">Brazilian Jiu Jitsu</a>. Think of it as wrestling but the goal is not a pin, it's a submission or a choke that either makes the other person "tap out" or "go to sleep." No one was prepared for the fighting style. He <a href="https://www.youtube.com/watch?v=URK1-4s2m0k">dominated the competition</a>. As mixed martial arts developed, it was clear that everyone needed to learn Brazilian Jiu Jitsu. I practice it now.
</p>

<p>
I interpret Royce Gracie at UFC1 in the following way. Hand-to-hand combat, as shown to us by choreographed <a href="https://en.wikipedia.org/wiki/List_of_martial_arts_films">Hollywood films</a>, pretended to be about striking (often accompanied by 'ha-yah'). But it often ultimately goes to the ground, part of a much larger system called groundfighting. So if you worked on your groundfighting, you could get the fight to go to the ground as fast as possible to mitigate striking and use chokes and submissions to control a hand-to-hand combat situation however you like.
</p>

<p>
This is also known in my circles as hacking. You're exploiting a vulnerability. In this case, it was our Hollywood-induced bias as to what fighting was. The best article I've read about hacking comes from well-known blogger <a href="https://gwern.net/unseeing">Gwern</a>, where he details the structure of hacking, which he calls "seeing through and unseeing," in the following way:
</p>

<hr />
<p>
<i>In each case, the funda⁣men⁣tal prin⁣ci⁣ple is that the hacker asks: “here I have a sys⁣tem W, which pretends to be made out of a few <a href="https://github.com/kdeldycke/awesome-falsehood">Xs⁠</a>; however, it is really made out of many Y, which form an entirely dif⁣fer⁣ent sys⁣tem, Z; I will now proceed to ig⁣nore the X and under⁣stand how Z works, so I may use the Y to thereby change W however I like”.</i>
</p>
<hr />

<p>
Let's go back to Royce Gracie, and formulate it in this way. I'll note that I had the following paragraph edited by a good friend of mine who is a fourth degree Brazilian Jiu Jitsu black belt, to make sure I got it right.
</p>

<p>
Here I have a system of hand-to-hand combat (W), which pretends to be made up solely of striking moves (X's); however it often ultimately goes to the ground, where it is made up of many grappling moves (Y's), which make up an entirely different system of groundfighting (Z); I will now proceed to ignore the usual focus on striking (X) and understand how groundfighting (Z) works, so I may facilitate the fight going to the ground as quickly as possible to mitigate strikes, where I can use grappling moves (Y) control a hand-to-hand combat situation (W) however I like.
</p>

<p>
I'll note that now hand-to-hand combat has evolved to include groundfighting, so we can't go in like Royce Gracie and beat everyone up unexpectedly anymore. The vulnerability, the "pretending," is gone. I am illustrating this UFC1 situation because I know we all have seen instances like this before in our lives. My current work is dependent on having a hacker mindset, and looking for instances where Gwern's framework rings true. If I don't have a hacker mindset, <a href="https://slatestarcodex.com/2014/07/30/meditations-on-moloch/">the ones who do will run me over</a>. 
</p>
</div>
</div>

<div id="outline-container-org910a34f" class="outline-2">
<h2 id="org910a34f">Examples of hacking that I've seen in my life</h2>
<div class="outline-text-2" id="text-org910a34f">
<p>
Now that Gwern has given us this framework, I can go in and show you instances where I've either seen this, or experienced this first hand. I intend for this article to grow over time with more and more examples as I collect them. 
</p>
</div>

<div id="outline-container-org6d493cb" class="outline-3">
<h3 id="org6d493cb">Basketball: Dennis Rodman and rebounds</h3>
<div class="outline-text-3" id="text-org6d493cb">
<p>
In the 90s, we all followed Michael Jordan and the Chicago Bulls. He was untouchable. A best in a generation all-around player. Wait. Let's pause on all-around player.
</p>

<p>
In the 90s, and to an extent now, basketball glory pretended to be about scoring as many points as possible. But Michael Jordan's teammate Dennis Rodman saw that glory is also about any other number of metrics, especially rebounds, that make up a much larger system called defensive game. If Rodman ignored scoring altogether and hyperfocused on defensive game, he could use a specialization in rebounds to be valuable to the team and therefore attain basketball glory. Arguably, he was so valuable to the team (watch his episode on the series <a href="https://en.wikipedia.org/wiki/The_Last_Dance_(miniseries)">The Last Dance</a>) that he could get away with being an extremely controversial character off-court without being cut from the team.
</p>
</div>
</div>

<div id="outline-container-org99ad565" class="outline-3">
<h3 id="org99ad565">Bodybuilding</h3>
<div class="outline-text-3" id="text-org99ad565">
<p>
Muscle building pretends to be about being <a href="https://www.youtube.com/watch?v=Nok-jOYn6Dg">strong</a>, and being able to lift extremely heavy weights. While there is a correlation (and you can train for both), the exclusive act of building muscle is actually about stressing the muscle with a weight you can lift, slowly up and even slower down, for higher reps (eg. 8 or more), for many sets, and then properly recovering with the right rest and nutrition. This makes up a much larger system called <a href="https://www.youtube.com/watch?v=CyDLbrZK75U">hypertrophy training, distinct from strength training</a>. So if the goal is exclusively bodybuilding, you ignore the idea of being strong altogether and focus on hypertrophy training, where you can use the right weight lifting styles and nutrition, to maximize muscle building.
</p>
</div>
</div>

<div id="outline-container-org8375057" class="outline-3">
<h3 id="org8375057">Going to work: value transactions</h3>
<div class="outline-text-3" id="text-org8375057">
<p>
The concept of working to put food on the table pretends to be all about becoming competent at a thing, and getting a <a href="https://www.youtube.com/watch?v=jsLUidiYm0w">job</a>. However, it is really about fulfilling a specific need in any sort of way, in any place, over any time horizon. This makes up part of a bigger system of value transactions, that include things like <a href="https://en.wikipedia.org/wiki/Form_1099">independent contracting</a> or fixed consulting projects, for <a href="https://www.upwork.com/">services</a> or <a href="https://www.shopify.com/">products</a>, in exchange for cash, equity, new leads, new connections, visibility, and any number of things deemed "<a href="https://en.wikipedia.org/wiki/Return_on_investment">valuable</a>." So by understanding the true nature of value transactions (especially what value actually is), I can do the same work I'd otherwise do at a job, but on a self-employment basis, with much more upside and freedom.
</p>
</div>
</div>

<div id="outline-container-org66418c0" class="outline-3">
<h3 id="org66418c0">Postdocs: training vs employment</h3>
<div class="outline-text-3" id="text-org66418c0">
<p>
The concept of highly skilled employment pretends to be about <a href="https://en.wikipedia.org/wiki/Postgraduate_education">training</a> future employees until they are competent workers, and then placing them into employment positions, where they can command high salaries. But the words "training" and "employment" are rather arbitrary, making up a much larger system of "getting as much out of highly skilled people as possible for as little money as possible." If you study that system, <a href="https://sci-hub.ru/https://www.nature.com/articles/nbt.3766">particularly in the life sciences</a>, you find that you can take <a href="https://en.wikipedia.org/wiki/Postdoctoral_researcher">postdoctoral</a> "training," stretch it out to nearly the length of a PhD position, and then stack another one on top of it ad infinitum, until you have people in their 40s who have worked evenings and weekends their whole life, still making <a href="https://postdocinusa.com/postdoc-salary-usa/">$60k per year</a> with reduced <a href="https://www.nature.com/articles/nj7568-279a">benefits</a> because they're still not employees. They're in training.
</p>
</div>
</div>

<div id="outline-container-org7d69d9d" class="outline-3">
<h3 id="org7d69d9d">Black box algorithms: dimension reduction</h3>
<div class="outline-text-3" id="text-org7d69d9d">
<p>
Dimension reduction visualization tools like t-SNE and UMAP pretend to be made up of your data, perfectly organized in a way that perfectly captures the high-dimensional data in every way. Or put differently, we pretend that this is the case, due to the <a href="https://tjburns08.github.io/the_beauty_is_truth_delusion.html">beauty is truth delusion</a>. When in reality, these dimension reduction tools are actually optimizations of a particular nearest-neighbor based loss function, which make up a much larger system of lossy (you lose some information) compression algorithms. So if we focus on revealing the lossiness, either through <a href="https://www.nature.com/articles/s41467-019-13055-y">manipulating the function's parameters</a>, or developing <a href="https://github.com/tjburns08/knn_sleepwalk">visual</a> <a href="https://tjburns08.github.io/tjb_dimr_talk.pdf">nearest neighbor-based evaluation metrics</a>, we can utilize what's being optimized to better understand the nature of t-SNE and UMAP.
</p>
</div>
</div>

<div id="outline-container-orgae59247" class="outline-3">
<h3 id="orgae59247">Jailbreaking GPT-N</h3>
<div class="outline-text-3" id="text-orgae59247">
<p>
We have generative large language models, which pretend to be prompt-based chatbots trained to behave ethically and help us with our questions. But they are really next token prediction models, part of a bigger system that is a superposition of <a href="https://www.lesswrong.com/posts/vJFdjigzmcXMhNTsx/">simulations</a> (write a Shakespearean sonnet, answer this physics question, etc) constrained by the prompt. Studying simulation theory allows one to realize that the simulation that is ethical can easily simulate its antipode by flipping a couple of bits (won't tell you how to take over the world -&gt; will tell you how to take over the world). This is known as the <a href="https://www.lesswrong.com/posts/D7PumeYTDPfBTp3i7/the-waluigi-effect-mega-post">Waluigi effect</a>, which gives you a theoretical path to <a href="https://gist.github.com/coolaj86/6f4f7b30129b0251f61fa7baaa881516">jailbreak</a> the <a href="https://www.lesswrong.com/posts/jtoPawEhLNXNxvgTT/bing-chat-is-blatantly-aggressively-misaligned">models</a>, no matter how much they try to <a href="https://www.deepmind.com/blog/learning-through-human-feedback">patch</a> them, allowing you to control them however you like.
</p>
</div>
</div>
</div>

<div id="outline-container-orge67f267" class="outline-2">
<h2 id="orge67f267">How to cultivate the hacker mindset</h2>
<div class="outline-text-2" id="text-orge67f267">
<p>
I have written about how every time I think I understand something, I find out that <a href="./its_more_complicated_than_that.html">it's more complicated than that</a>. The first thing I'll say is that now I welcome these instances, where my model of something is broken by some outlier that doesn't quite fit. These are the things that get me to shift from thinking about system W to the hidden system Z. But the other key point is a lot of the "hacks" I have found have been not from thinking, but from doing.
</p>

<p>
When I transitioned from academia into self employment, I was able to see both academia and employment from the outside, and start to see what they were pretending to be, and what they really were. From there, I was able to get a more clear picture of what value and value transactions really were. Moving to Europe has allowed me to see the United States from the outside, and compare it to a completely different system, culture, <a href="https://en.wikipedia.org/wiki/Linguistic_relativity">language</a>, and way of doing things out here.
</p>

<p>
Learning how to code, and doing that for a living, has given me a <a href="./coding_as_philosophical_project.html">rich new language</a> to see and express abstractions that are otherwise hard to put into words. This, and the fact that I have to exercise "seeing through and unseeing" every day in order to analyze novel datasets in novel ways, keeps me in practice in terms of finding hidden systems underneath surface level abstractions.
</p>

<p>
Finally, I think that the hacker mindset is not about being smart or some sort of technical whiz kid. That's a Hollywood bias, much like the martial arts film bias I opened with. I think it's about finding all the places where you're "different" and leaning into it rather than trying to fall in line. Where I'm "different" (American PhD ex-academic living in Europe running a European company with American clients, etc) I can see the "not different" counterparts more clearly for what they really are. And so can you.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: March 15, 2023 - March 15, 2023</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.1 (<a href="https://orgmode.org">Org</a> mode 9.5.2)</p>
</div>
</body>
</html>
